Repository: osumionline/Osumi-Framework
Catalog: ofw/locale/*.po
Languages: es, eu

# ERROR_TITLE
source: Error
eu: Errorea

# ERROR_403_LABEL
source: 403 Authentication error
es: 403 Error de autenticación
eu: 403 Autentifikazio errorea

# ERROR_404_LABEL
source: 404 Page not found
es: 404 Página no encontrada
eu: 404 Orria ez da aurkitu

# ERROR_500_LABEL
source: 500 Internal server error
es: 500 Error interno del servidor
eu: 500 Zerbitzariaren barneko errorea

# ERROR_NO_MODULE_LABEL
source: Module <strong>%s</strong> not found
es: Módulo <strong>%s</strong> no encontrado
eu: <strong>%s</strong> modulua ez da aurkitu

# ERROR_NO_ACTION_LABEL
source: Function <strong>%s</strong> not found on <strong>%s</strong> module
es: Función <strong>%s</strong> no encontrada en módulo <strong>%s</strong>
eu: <strong>%s</strong> funtzioa ez da aurkitu <strong>%s</strong> moduluan

# ERROR_SEE_MORE_LABEL
source: See more details
es: Ver más detalles
eu: Xehetasun gehiago ikusi

# TASK_BACKUP_ALL
source: Generate a backup file (extractor file) of the whole application (database and code). Calls internally to "backupDB" and "extractor" tasks.
es: Función para crear una copia de seguridad de TODA la aplicación (base de datos más archivos).
eu: Aplikazioaren (datu-base eta kodea) babeskopia-fitxategi (erauzgailu-fitxategia) bat sortu. Barneki "backupDB" eta "extractor" zereginei deitzen da.

# TASK_BACKUP_ALL_DONE
source: Backup complete
es: Copia de seguridad completada.
eu: Babeskopia egina

# TASK_BACKUP_DB
source: Performs a database backup using "mysqldump" CLI tool. Generates a file on ofw/export folder with the name of the database.
es: Función para crear una copia de seguridad de la base de datos.
eu: Datu-basearen babeskopia egiten du "mysqldump" CLI herraminta erabiliz. ofw/export karpetan, datu-basearen izena duelarik, fitxategi bat sortzen da.

# TASK_BACKUP_DB_NO_DB
source: There is no database configured.
es: No hay ninguna base de datos configurada.
eu: Ez dago konfiguratua dagoen datu-baserik.

# TASK_BACKUP_DB_EXPORTING
source: Exporting "%s" database to file "%s"
es: Exportando base de datos "%s" al archivo "%s"
eu: "%s" datu-basea "%s" fitxategira esportatzen.

# TASK_BACKUP_DB_EXISTS
source: Destiny file already existed, it has been deleted.
es: Archivo destino ya existía, se ha borrado.
eu: Helburu-fitxategia jada bazegoen, ezabatua izan da.

# TASK_BACKUP_DB_SUCCESS
source: Database successfully exported.
es: Base de datos exportada con éxito.
eu: Datu-basea arrakastaz esportatu da.

# TASK_EXTRACTOR
source: Function to export an application with all its files to a single self-extracting php file
es: Función para exportar una aplicación con todos sus archivos a un solo archivo autoextraíble.
eu: Aplikazio bat bere fitxategi guztiekin automatikoki erauzten den PHP fitxategi bakar batera esportatzeko funtzioa

# TASK_EXTRACTOR_EXPORTING
source: Exporting project
es: Exportando proyecto
eu: Proiektua esportatzen

# TASK_EXTRACTOR_EXISTS
source: Destiny file already existed, it has been deleted.
es: Archivo destino ya existía, se ha borrado.
eu: Helburu-fitxategia jada bazegoen, ezabatua izan da.

# TASK_EXTRACTOR_GETTING_FILES
source: Getting folders and files to export...
es: Obteniendo carpetas y archivos a exportar...
eu: Karpetak eta fitxategiak lortzen esportatzeko...

# TASK_EXTRACTOR_EXPORTING_FILES
source: Exporting %s files.
es: Exportando %s archivos.
eu: %s fitxategia esportatzen.

# TASK_EXTRACTOR_EXPORTING_FOLDERS
source: Exporting %s folders.
es: Exportando %s carpetas.
eu: %s karpeta esportatzen.

# TASK_EXTRACTOR_GETTING_READY
source: Preparing extractor...
es: Preparando extractor...
eu: Erauzgailua prestatzen...

# TASK_EXTRACTOR_BASE_FOLDER
source: BASE PATH
es: RUTA BASE
eu: OINARRIZKO HELBIDEA

# TASK_EXTRACTOR_CREATE_FOLDERS
source: CREATING FOLDERS
es: CREANDO CARPETAS
eu: KARPETAK SORTZEN

# TASK_EXTRACTOR_CREATE_FILES
source: CREATING FILES
es: CREANDO ARCHIVOS
eu: FITXATEGIAK SORTZEN

# TASK_EXTRACTOR_END
source: Project has been exported.
es: Proyecto exportado.
eu: Proiektua esportatua izan da.

# TASK_GENERATE_MODEL
source: Generate a SQL file to create all the tables in the database based on user defined models (file generated on ofw/export).
es: Función para generar el script con el que crear la base de datos a partir del modelo.
eu: SQL fitxategi bat sortu erabiltzaileak definitutako modulutan oinarritutako datu-baseko taula guztiak sortzeko (fitxategia ofw/export-en sortua).

# TASK_GENERATE_MODEL_MODEL
source: Model
es: Modelo
eu: Eredua

# TASK_GENERATE_MODEL_EXISTS
source: Destiny file already existed, it has been deleted.
es: El archivo ya existía y ha sido borrado.
eu: Helburu-fitxategia jada bazegoen, ezabatua izan da.

# TASK_GENERATE_MODEL_GENERATED
source: Model file generated: %s
es: Archivo de modelo generado: %s
eu: Eredu-fitxategia sortua: %s

# TASK_PLUGINS
source: Task to manage plugins (list available / install / remove)
es: Función para obtener el listado de plugins disponibles.
eu: Pluginak manipulatzeko zeregina (zerrendatu erabilgarriak / instalatu / ezabatu)

# TASK_PLUGINS_AVAILABLE_TITLE
source: Available plugin list:
es: Listado de plugins disponibles:
eu: Erabilgarri dauden pluginen zerrenda:

# TASK_PLUGINS_AVAILABLE_INSTALL
source: To install any of the plugins run the following command:
es: Para instalar cualquiera de estos plugins ejecuta el siguiente comando:
eu: Edozein plugin instalatzeko sakatu hurrengo komandoa:

# TASK_PLUGINS_AVAILABLE_LIST
source: You can also see the plugin list that are currently installed running the following command:
es: También puedes ver el listado de plugins que tienes actualmente instalados ejecutando el siguiente comando:
eu: Baita ere, instalatuta dauden pluginen zerrenda ikusteko komando hau sakatu:

# TASK_PLUGINS_AVAILABLE_DELETE
source: To remove a plugin that is currently installed run the following command:
es: Para borrar un plugin instalado actualmente ejecuta el siguiente comando:
eu: Instalatuta dagoen plugin bat ezabatzeko sakatu hurrengo komandoa:

# TASK_PLUGINS_AVAILABLE_NAME
source: name
es: nombre
eu: izena

# TASK_PLUGINS_INSTALL_ERROR
source: You must indicate the name of the plugin you want to install, for example:
es: Debes indicar el nombre del plugin que quieres instalar, por ejemplo:
eu: Instalatu nahi duzun pluginaren izena zehaztu behar duzu, adibidez:

# TASK_PLUGINS_INSTALL_NOT_AVAILABLE
source: The indicated plugin does not exist in the list of installable plugins.
es: El plugin indicado no existe en la lista de plugins instalables.
eu: Adierazitako plugina ez da ageri instalagarri dauden pluginen zerrendan.

# TASK_PLUGINS_INSTALL_CHECK_LIST
source: Check the list by running the following command:
es: Comprueba la lista ejecutando el siguiente comando:
eu: Ikusi zerrenda hurrengo komandoa sakatuz:

# TASK_PLUGINS_INSTALL_FOLDER_EXISTS
source: Folder "%s" already exists.
es: La carpeta "%s" ya existe.
eu: "%s" karpeta jada badago.

# TASK_PLUGINS_INSTALL_CREATE_FOLDER
source: New folder created: "%s"
es: Nueva carpeta creada: "%s"
eu: Karpeta berria sortua: "%s"

# TASK_PLUGINS_INSTALL_CREATE_CONFIG
source: Creating plugin configuration file: "%s"
es: Creado archivo de configuración del plugin: "%s"
eu: Pluginak konfiguratzeko fitxategia sortzen: "%s"

# TASK_PLUGINS_INSTALL_CREATE_FILE
source: Plugin file created: "%s"
es: Creado archivo del plugin: "%s"
eu: Plugin-fitxategia sortua: "%s"

# TASK_PLUGINS_INSTALL_DOWNLOAD_DEPS
source: Downloading dependencies:
es: Descargando dependencias:
eu: Mendekotasunak jaisten:

# TASK_PLUGINS_INSTALL_NEW_DEP
source: New file created: "%s/"
es: Nuevo archivo creado: "%s"
eu: Fitxategi berria sortua: "%s/"

# TASK_PLUGINS_INSTALL_DONE
source: Installation complete.
es: Instalación finalizada.
eu: Instalazioa burutu da.

# TASK_PLUGINS_INSTALLED
source: Installed plugins:
es: Plugins instalados:
eu: Instalatutako pluginak:

# TASK_PLUGINS_INSTALLED_NONE
source: There are no plugins installed.
es: No tienes instalado ningún plugin.
eu: Ez dago pluginik instalatua.

# TASK_PLUGINS_REMOVE_ERROR
source: You must indicate the name of the plugin you want to uninstall, for example:
es: Debes indicar el nombre del plugin que quieres desinstalar, por ejemplo:
eu: Desinstalatu nahi duzun pluginaren izena zehaztu behar duzu, adibidez:

# TASK_PLUGINS_REMOVE_NOT_INSTALLED
source: Indicated plugin is not installed.
es: El plugin indicado no está instalado.
eu: Adierazitako plugina ez dago instalatua.

# TASK_PLUGINS_REMOVE_CHECK_LIST
source: Check the list by running the following command:
es: Comprueba la lista ejecutando el siguiente comando:
eu: Ikusi zerrenda hurrengo komandoa sakatuz:

# TASK_PLUGINS_REMOVE_FOLDER_NOT_FOUND
source: Folder "%s" does not exist.
es: La carpeta "%s" no existe.
eu: "%s" karpeta ez dago.

# TASK_PLUGINS_REMOVE_CONF_REMOVED
source: Configuration file "%s" deleted.
es: Archivo de configuración "%s" borrado.
eu: "%s" konfigurazio-fitxategia ezabatua.

# TASK_PLUGINS_REMOVE_PLUGIN_REMOVED
source: Plugin file "%s" deleted.
es: Archivo de plugin "%s" borrado.
eu: "%s" plugin-fitxategia ezabatua.

# TASK_PLUGINS_REMOVE_REMOVING_DEPS
source: Deleting dependencies...
es: Borrando dependencias...
eu: Mendekotasunak ezabatzen...

# TASK_PLUGINS_REMOVE_DEP_REMOVED
source: File "%s" deleted.
es: Archivo "%s" borrado.
eu: "%s" fitxategia ezabatua.

# TASK_PLUGINS_REMOVE_DEP_FOLDER_REMOVED
source: Dependencies folder "%s/dependencies" deleted.
es: Carpeta de dependencias "%s/dependencies" borrada.
eu: "%s/dependencies" mendekotasunen karpeta ezabatua.

# TASK_PLUGINS_REMOVE_FOLDER_REMOVED
source: Plugin folder "%s" deleted.
es: Carpeta de plugin "%s" borrada.
eu: "%s" pluginen karpeta ezabatua.

# TASK_PLUGINS_REMOVE_DONE
source: Remove complete.
es: Borrado finalizado.
eu: Ezabapena burutu da.

# TASK_PLUGINS_UPDATE_CHECK_NO_PLUGINS
source: There is no plugin installed.
es: No hay ningún plugin instalado.
eu: Ez dago pluginik instalatua.

# TASK_PLUGINS_UPDATE_CHECK_CHECKING
source: Looking for updates...
es: Buscando actualizaciones...
eu: Eguneratzeen bila...

# TASK_PLUGINS_UPDATE_CHECK_VERSION
source: Installed version: %s
es: Versión instalada: %s
eu: Instalatutako bertsioa: %s

# TASK_PLUGINS_UPDATE_CHECK_CURRENT_VERSION
source: Current version: %s
es: Versión actual: %s
eu: Oraingo bertsioa: %s

# TASK_PLUGINS_UPDATE_CHECK_AVAILABLE
source: Update available!
es: ¡Actualización disponible!
eu: Eguneraketa eskuragarri!

# TASK_PLUGINS_UPDATE_CHECK_UPDATE
source: To update your plugins to the current version run the following command:
es: Para actualizar tus plugins a la versión actual ejecuta el siguiente comando:
eu: Zure pluginak oraingo bertsiora eguneratzeko hurrengo komandoa saka ezazu:

# TASK_PLUGINS_UPDATE_NO_PLUGINS
source: There is no plugin installed.
es: No hay ningún plugin instalado.
eu: Ez dago pluginik instalatua.

# TASK_PLUGINS_UPDATE_CHECKING
source: Looking for updates...
es: Buscando actualizaciones...
eu: Eguneraketen bila...

# TASK_PLUGINS_UPDATE_INSTALLED_VERSION
source: Installed version: %s
es: Versión instalada: %s
eu: Instalatutako bertsioa: %s

# TASK_PLUGINS_UPDATE_CURRENT_VERSION
source: Current version: %s
es: Versión actual: %s
eu: Oraingo bertsioa: %s

# TASK_PLUGINS_UPDATE_UPDATING
source: Preparing update...
es: Preparando actualización...
eu: Eguneraketa prestatzen...

# TASK_PLUGINS_UPDATE_TO_BE_DELETED
source: File "%s" will be deleted.
es: El archivo "%s" será eliminado.
eu: "%s" fitxategia ezabatua izango da.

# TASK_PLUGINS_UPDATE_FILE_NOT_FOUND
source: File "%s" does not exist.
es: El archivo "%s" no existe.
eu: "%s" fitxategia ez dago.

# TASK_PLUGINS_UPDATE_DOWNLOADING
source: Downloading "%s"
es: Descargando "%s"
eu: "%s" jaisten...

# TASK_PLUGINS_UPDATE_FILE_EXISTS
source: File already exists, creating backup.
es: El archivo ya existe, creando copia de seguridad.
eu: Fitxategia jada badago, babeskopia sortzen.

# TASK_PLUGINS_UPDATE_FILE_UPDATED
source: File updated.
es: Archivo actualizado.
eu: Fitxategia eguneratua.

# TASK_PLUGINS_UPDATE_NEW_FILE
source: New file created.
es: Nuevo archivo creado.
eu: Fitxategi berria sortua.

# TASK_PLUGINS_UPDATE_VERSION_UPDATED
source: Updating version file.
es: Actualizando archivo de versión.
eu: Fitxategiaren bertsioa eguneratzen.

# TASK_PLUGINS_UPDATE_DONE
source: Update complete.
es: Actualización terminada.
eu: Eguneraketa burutu da.

# TASK_PLUGINS_DEFAULT_NOT_VALID
source: Indicated command is not a valid option.
es: El comando indicado no es una opción válida.
eu: Adierazitako komandoa ez da onartutako aukera bat.

# TASK_PLUGINS_DEFAULT_AVAILABLE_OPTIONS
source: Available options are:
es: Las opciones disponibles son:
eu: Eskuragarri dauden aukerak:

# TASK_PLUGINS_DEFAULT_LIST
source: Installed plugin list.
es: Lista de plugins instalados.
eu: Instalatutako pluginen zerrenda.

# TASK_PLUGINS_DEFAULT_INSTALL
source: To install a new plugin.
es: Para instalar un nuevo plugin.
eu: Plugin berri bat instalatzeko.

# TASK_PLUGINS_DEFAULT_REMOVE
source: To remove a currently installed plugin.
es: Para borrar un plugin instalado.
eu: Instalatutako plugin bat ezabatzeko.

# TASK_PLUGINS_DEFAULT_UPDATE_CHECK
source: To check if there are any updates of the installed plugins.
es: Para comprobar si existen actualizaciones de los plugins instalados.
eu: Ea instalatutako pluginek eguneratzeak dituzten konprobatzeko.

# TASK_PLUGINS_DEFAULT_UPDATE
source: To update installed plugins.
es: Para actualizar los plugins instalados.
eu: Instalatutako pluginak eguneratzeko.

# TASK_PLUGINS_DEFAULT_NO_OPTION
source: If you don't indicate any parameter the available plugin list is shown.
es: En caso de no indicar ningún parámetro se muestra la lista de plugins que se pueden instalar.
eu: Ez baduzu parametrorik adierazten, eskuragarri dauden pluginen zerrenda erakutsiko da.

# TASK_UPDATE
source: Update Framework files to a newer version.
es: Función para actualizar el Framework.
eu: Framework-a bertsio berri batera eguneratzeko.

# TASK_UPDATE_AVAILABLE
source: %s new updates have been found. Installation will begin in order.
es: Se han encontrado %s actualizaciones pendientes. Se procede a la instalación ordenada.
eu: %s eguneraketa berri aurkitu dira. Instalazioa behar bezala hasiko da.

# TASK_UPDATE_FILE_DELETE
source: File "%s" will be deleted.
es: El archivo "%s" será eliminado.
eu: "%s" fitxategia ezabatuko da.

# TASK_UPDATE_NOT_FOUND
source: File "%s" can't be found.
es: El archivo "%s" no se encuentra.
eu: Ezin da "%s" fitxategia aurkitu.

# TASK_UPDATE_DOWNLOADING
source: Downloading "%s"
es: Descargando "%s"
eu: "%s" jaisten

# TASK_UPDATE_FILE_EXISTS
source: File already exists, creating backup.
es: El archivo ya existe, creando copia de seguridad.
eu: Fitxategia jada badago, babeskopia sortzen.

# TASK_UPDATE_NEW_FILE
source: Creating new file.
es: Creando nuevo archivo.
eu: Fitxategi berria sortzen.

# TASK_UPDATE_ALL_UPDATED
source: All files have been updated. The new installed version is: %s
es: Todos los archivos han sido actualizados. La nueva versión instalada es: %s
eu: Fitxategi guztiak eguneratu dira. Instalatutako bertsio berria hauxe da: %s

# TASK_UPDATE_DELETE_BACKUPS
source: Created backups will be deleted.
es: Se procede a eliminar las copias de seguridad realizadas.
eu: Sortutako babeskopiak ezabatuak izango dira.

# TASK_UPDATE_UPDATE_ERROR
source: An error has ocurred while updating the files, backups will be restored.
es: Ocurrió un error al actualizar los archivos, se procede a restaurar las copias de seguridad.
eu: Errore bat jazo da fitxategiak eguneratu bitartean, babeskopiak berreskuratuko dira.

# TASK_UPDATE_INSTALLED_VERSION
source: Installed version: %s
es: Versión instalada: %s
eu: Instalatutako bertsioa: %s

# TASK_UPDATE_CURRENT_VERSION
source: Current version: %s
es: Versión actual: %s
eu: Oraingo bertsioa: %s

# TASK_UPDATE_UPDATING
source: Update will begin.
es: Se procede a la actualización.
eu: Eguneraketa hasiko da.

# TASK_UPDATE_UPDATED
source: Installed version is up to date.
es: La versión instalada está actualizada.
eu: Instalatutako bertsioa eguneratua dago.

# TASK_UPDATE_NEWER
source: Installed version is NEWER than the one in the repository!!
es: ¡¡La versión instalada está MÁS actualizada que la del repositorio!!
eu: Instalatutako bertsioa biltegian dagoena baino BERRIAGOA da!!

# TASK_UPDATE_CHECK
source: Check if there are new updates on the Framework
es: Función para comprobar si existen actualizaciones del Framework.
eu: Konprobatu ea eguneraketarik dagoen Frameworkean

# TASK_UPDATE_CHECK_DO_UPDATE
source: To proceed to the update run the following command:
es: Para proceder a la actualización ejecuta el siguiente comando:
eu: Eguneraketarekin jarraitzeko sakatu hurrengo komandoa:

# TASK_UPDATE_CHECK_INSTALLED_VERSION
source: Installed version: %s
es: Versión instalada: %s
eu: Instalatutako bertsioa: %s

# TASK_UPDATE_CHECK_CURRENT_VERSION
source: Current version: %s
es: Versión actual: %s
eu: Oraingo bertsioa: %s

# TASK_UPDATE_CHECK_LIST
source: Update will modify the following files:
es: La actualización modificará los siguientes archivos:
eu: Eguneraketak hurrengo fitxategiak aldatuko ditu:

# TASK_UPDATE_CHECK_UPDATED
source: Installed version is up to date.
es: La versión instalada está actualizada.
eu: Instalatutako bertsioa eguneratua dago.

# TASK_UPDATE_CHECK_NEWER
source: Installed version is NEWER than the one in the repository!!
es: ¡¡La versión instalada está MÁS actualizada que la del repositorio!!
eu: Instalatutako bertsioa biltegian dagoena baino BERRIAGOA da!!

# TASK_UPDATE_URLS
source: Updates URLs cache file
es: Función para crear nuevos módulos, acciones y plantillas a partir del archivo de urls.
eu: URLen cache-fitxategiak eguneratzen ditu

# TASK_UPDATE_URLS_UPDATING
source: Updating modules/actions...
es: Actualizando módulos/acciones...
eu: Moduluak/ekintzak eguneratzen...

# TASK_UPDATE_URLS_RESERVED
source: The name you picked for the module is a reserved word (%s). The module can't have these names:
es: El nombre del módulo es una palabra reservada (%s). El módulo no puede llamarse de las siguientes maneras:
eu: Modulurako aukeratu duzun izena erreserbatutako hitz bat da (%s). Moduluak ezin ditu izen hauek eduki:

# TASK_UPDATE_URLS_MODULE
source: Module
es: Módulo
eu: Modulua

# TASK_UPDATE_URLS_ACTION
source: Action
es: Acción
eu: Ekintza

# TASK_UPDATE_URLS_ACTION_MODULE
source: An action can't have the same name as the module it is contained in:
es: Una acción no puede llamarse igual que el módulo que la contiene:
eu: Ekintza batek ezin du dagoen moduluko izen bera eduki:

# TASK_UPDATE_URLS_NEW_MODULE
source: New module "%s" created on file "%s".
es: Nuevo módulo %s creado en el archivo %s.
eu: "%s" modulu berria "%s" fitxategian sortua.

# TASK_UPDATE_URLS_NEW_TEMPLATE_FOLDER
source: New template folder "%s" created.
es: Nueva carpeta para plantillas %s creada.
eu: "%s" txantiloi-karpeta berria sortua.

# TASK_UPDATE_URLS_NEW_ACTION
source: New action "%s" created on module "%s".
es: Nueva acción "%s" creada en el módulo "%s".
eu: "%s" ekintza berria "%s" moduluan sortua.

# TASK_UPDATE_URLS_NEW_TEMPLATE
source: New template "%s" created.
es: Nueva plantilla "%s" creado.
eu: "%s" txantiloi berria sortua.

# TASK_UPDATE_URLS_ERROR
source: There were errors updating modules and actions. Check the errors and run again the "updateUrls" task
es: Ocurrieron errores al actualizar módulos y acciones. Revisa los errores y vuelve a ejecutar la tarea "updateUrls"
eu: Moduluak eta ekintzak eguneratzerakoan errore hauek jazo dira. Konprobatu erroreak eta exekutatu berriro "updateUrls" zeregina

# TASK_UPDATE_URLS_ALL_UPDATED
source: Everything is up to date.
es: Todo está actualizado.
eu: Dena eguneratua dago.

# TASK_VERSION
source: Get Frameworks current version information.
es: Función para obtener el número de versión actual del Framework.
eu: Frameworkaren oraingo bertsioaren informazioa jaso.

# TASK_ADD
source: Add new modules, actions, services or tasks.
es: Añade nuevos módulos, acciones, servicios o tareas.
eu: Modulu, ekintza, zerbitzu edo zeregin berriak gehitu.

# TASK_ADD_DEFAULT_NOT_VALID
source: Indicated command is not a valid option.
es: El comando indicado no es una opción válida.
eu: Adierazitako komandoa ez da onartutako aukera bat.

# TASK_ADD_DEFAULT_AVAILABLE_OPTIONS
source: Available options are:
es: Las opciones disponibles son:
eu: Eskuragarri dauden aukerak hauexek dira:

# TASK_ADD_DEFAULT_MODULE
source: Create a new module
es: Crea un nuevo módulo
eu: Modulu berri bat sortu

# TASK_ADD_DEFAULT_ACTION
source: Create a new action in a module
es: Crea una nueva acción en un módulo
eu: Ekintza berri bat sortu modulu batean

# TASK_ADD_DEFAULT_SERVICE
source: Create a new service
es: Crea un nuevo servicio
eu: Zerbitzu berri bat sortu

# TASK_ADD_DEFAULT_TASK
source: Create a new task
es: Crea una nueva tarea
eu: Ataza berri bat sortu

# TASK_ADD_DEFAULT_MODEL_COMPONENT
source: Create a component for a model
es: Crea un componente para un modelo
eu: Modulurako osagai berri bat sortu

# TASK_ADD_MODULE_ERROR
source: You must indicate the name of the module you want to create, for example:
es: Debes indicar el nombre del módulo que quieres crear, por ejemplo:
eu: Sortu nahi duzun moduluaren izena adierazi behar duzu, adibidez:

# TASK_ADD_MODULE_EXISTS
source: Module file "%s" already exists.
es: El archivo de módulo "%s" ya existe.
eu: "%s" modulu-fitxategia jada badago.

# TASK_ADD_MODULE_NEW_MODULE
source: New module "%s" created:
es: Nuevo módulo "%s" creado:
eu: "%s" modulu berria sortua:

# TASK_ADD_MODULE_NEW_FOLDER
source: New folder "%s" created.
es: Nueva carpeta "%s" creada.
eu: "%s" karpeta berria sortua.

# TASK_ADD_MODULE_NEW_FILE
source: New file "%s" created.
es: Nuevo archivo "%s" creado.
eu: "%s" fitxategi berria sortua.

# TASK_ADD_ACTION_MESSAGE
source: New action %s
es: Nueva acción %s
eu: %s ekintza berria

# TASK_ADD_ACTION_TEMPLATE
source: New action <strong>%s</strong> works!
es: ¡La nueva acción <strong>%s</strong> funciona!
eu: <strong>%s</strong> ekintza berria badabil!

# TASK_ADD_ACTION_ERROR
source: You must indicate the name of the module where the action should go, the name of the action you want to create, it's URL, the type of the return and any utils classes you want it to use. For example:
es: Debes indicar el nombre del módulo donde debe ir la acción, el nombre de la acción que quieres crear, su URL, su tipo de retorno y si quieres añadir alguna clase de utils. Por ejemplo:
eu: Ekintza modulura doan izena adierazi behar duzu, sortu nahi duzun ekintzaren izena, bere URLa, zer nolako itzulera izango duen eta utils hautazko klaseen izenak. Adibidez:

# TASK_ADD_ACTION_NO_MODULE
source: Required module "%s" could not be found on "%s"
es: El módulo "%s" indicado no se pudo hallar en "%s"
eu: Eskatutako "%s" modulua ezin izan da aurkitu "%s"(e)n

# TASK_ADD_ACTION_EXISTS
source: Action "%s" already exists.
es: La acción "%s" ya existe.
eu: "%s" ekintza jada badago.

# TASK_ADD_ACTION_TEMPLATE_EXISTS
source: Template file "%s" already exists.
es: El archivo de plantilla "%s" ya existe.
eu: "%s" txantiloi-fitxategia jada badago.

# TASK_ADD_ACTION_NEW_ACTION
source: New action "%s" created on module "%s".
es: Nueva acción "%s" creada en el módulo "%s".
eu: "%s" ekintza berria "%s" moduluan sortua.

# TASK_ADD_ACTION_NEW_FOLDER
source: New folder "%s" created.
es: Nueva carpeta "%s" creada.
eu: "%s" karpeta berria sortua.

# TASK_ADD_ACTION_NEW_FILE
source: New action file "%s" created.
es: Nuevo archivo de acción "%s" creado.
eu: "%s" ekintza-fitxategi berria sortua.

# TASK_ADD_ACTION_NEW_TEMPLATE
source: New template file "%s" created.
es: Nuevo archivo de plantilla "%s" creado.
eu: "%s" txantiloi-fitxategi berria sortua.
