Repository: osumionline/Osumi-Framework
Catalog: ofw/locale/*.po
Languages: es, eu

# TASK_ADD_ACTION_URLS_UPDATED
source: Please run the following command to update URLs cache file:
es: Por favor, ejecuta el siguiente comando para actualizar el archivo de cache de URLs:
eu: Mesedez, idatzi hurrengoa URLen cache-fitxategia eguneratzeko:

# TASK_ADD_SERVICE_ERROR
source: You must indicate the name of the service you want to create, for example:
es: Debes indicar el nombre del servicio que quieres crear, por ejemplo:
eu: Sortu nahi duzun zerbitzuaren izena adierazi behar duzu, adibidez:

# TASK_ADD_SERVICE_EXISTS
source: Service file "%s" already exists.
es: El archivo de servicio "%s" ya existe.
eu: "%s" zerbitzu-fitxategia jada badago.

# TASK_ADD_SERVICE_NEW_SERVICE
source: New service "%s" created:
es: Nuevo servicio "%s" creado:
eu: "%s" zerbitzu berria sortua:

# TASK_ADD_SERVICE_NEW_FILE
source: New file "%s" created.
es: Nuevo archivo "%s" creado.
eu: "%s" fitxategi berria sortua.

# TASK_ADD_TASK_MESSAGE
source: New task %s
es: Nueva tarea %s
eu: "%s" ataza berria

# TASK_ADD_TASK_ERROR
source: You must indicate the name of the task you want to create, for example:
es: Debes indicar el nombre de la tarea que quieres crear, por ejemplo:
eu: Sortu nahi duzun atazaren izena adierazi behar duzu, adibidez:

# TASK_ADD_TASK_EXISTS
source: Task file "%s" already exists.
es: El archivo de tarea "%s" ya existe.
eu: "%s" ataza-fitxategia jada badago.

# TASK_ADD_TASK_NEW_TASK
source: New task "%s" created:
es: Nueva tarea "%s" creada:
eu: "%s" ataza berria sortua:

# TASK_ADD_TASK_NEW_FILE
source: New file "%s" created.
es: Nuevo archivo "%s" creado.
eu: "%s" fitxategi berria sortua.

# TASK_ADD_MODEL_COMPONENT_ERROR
source: You must indicate the name of the model whose component you want to create, for example:
es: Debes indicar el nombre del modelo cuyo componente quieres crear, por ejemplo:
eu: Sortu nahi duzun moduluaren osagaiaren izena adierazi behar duzu, adibidez:

# TASK_ADD_MODEL_COMPONENT_NO_MODEL
source: Required model "%s" could not be found.
es: El modelo indicado "%s" no se ha encontrado.
eu: "%s" eskatutako modulua ezin izan da aurkitu.

# TASK_ADD_MODEL_COMPONENT_FOLDER_EXISTS
source: Folder "%s" already exists.
es: La carpeta "%s" ya existe.
eu: "%s" karpeta jada badago.

# TASK_ADD_MODEL_COMPONENT_FILE_EXISTS
source: File "%s" already exists.
es: El archivo "%s" ya existe.
eu: "%s" fitxategia jada badago.

# TASK_ADD_MODEL_COMPONENT_FILE_CANT_CREATE
source: Can't create file "%s".
es: No se pudo crear el archivo "%s".
eu: "%s" fitxategia ezin da sortu.

# TASK_ADD_MODEL_COMPONENT_FOLDER_CREATED
source: New folder "%s" created.
es: Nueva carpeta "%s" creada.
eu: "%s" karpeta berria sortua.

# TASK_ADD_MODEL_COMPONENT_FILE_CREATED
source: New file "%s" created.
es: Nuevo archivo "%s" creado.
eu: "%s" fitxategi berria sortua.

# TASK_ADD_MODEL_COMPONENT_USE
source: New model component "%s" created. Use it with:
es: Nuevo componente de modelo "%s" creado. Se puede usar de la siguiente manera:
eu: "%s" modulu-osagaia sortua. Honekin erabili:

# OFW_INDICATE_OPTION
source: You have to indicate an option.
es: Tienes que indicar una opción.
eu: Aukera bat aukeratu behar duzu.

# OFW_OPTIONS
source: Options:
es: Opciones:
eu: Aukerak:

# OFW_EXAMPLE
source: For example
es: Por ejemplo
eu: Adibidez

# OFW_WRONG_OPTION
source: Option "%s" is wrong.
es: La opción "%s" no es correcta.
eu: "%s" aukera oker dago.

# TASK_RESET
source: Cleans all non framework data, to be used on new installations.
es: Limpia todos los datos que no son propios del framework, para usar en instalaciones nuevas.
eu: Ezabatzen du framework-eko ez diren fitxategi guztiak, instalazio berrietan erabiltzeko.

# TASK_RESET_WARNING
source: Â¡Warning!
es: ¡Atención!
eu: ¡Kontuz!

# TASK_RESET_CONTINUE
source: Next, we will proceed to delete all the content outside the framework, at the end it will have the status of a newly installed application.
es: A continuación se va a proceder a borrar todo el contenido ajeno al framework, al acabar tendrá el estado de una aplicación recién instalada.
eu: Jarraian, framework-etik kanpoko eduki guztia ezabatzeari ekingo diogu, amaieran instalatu berri den aplikazio baten egoera izango du.

# TASK_RESET_TIME_TO_CANCEL
source: You have 15 seconds to cancel this process by pressing Control + C.
es: Dispones de 15 segundos para cancelar este proceso presionando Control + C.
eu: Prozesu hau bertan behera uzteko 15 segundo dituzu Kontrol + C sakatuta.

# TASK_RESET_RESET_KEY_CREATED
source: Reset key created. To confirm the deletion of all data, execute the following command in the next 15 minutes:
es: Clave de reseteo creada. Para confirmar el borrado de todos los datos ejecuta el siguiente comando en los próximos 15 minutos:
eu: Berrezarri gakoa sortu da. Datu guztiak ezabatzea berresteko, exekutatu komando hau hurrengo 15 minutuetan:

# TASK_RESET_DATA_ERASED
source: Data erased!
es: ¡Datos borrados!
eu: Datuak ezabatu dira!

# TASK_RESET_ERROR
source: ERROR!
eu: ERROREA!

# TASK_RESET_GET_NEW_KEY
source: An error occurred when validating the reset key or it has already expired. Re-create a new key by running the following command:
es: Ocurrió un error al validar la clave de reseteo o ya ha expirado. Vuelve a crear una nueva clave ejecutando el siguiente comando:
eu: Errore bat gertatu da berrezartzeko gakoa balioztatzean edo dagoeneko iraungi da. Sortu berriro gako berri bat komando hau exekutatuz:

# PLUGIN_IMAGE_FILE_NOT_FOUND
source: ERROR! Required file was not found.
es: ERROR! La imagen solicitada no se ha podido encontrar.
eu: ERROREA! Eskatutako irudia ezin izan da aurkitu.

# PLUGIN_IMAGE_LOAD_ERROR
source: ERROR! There was an error loading the file.
es: ERROR! Ha ocurrido un error al cargar el archivo.
eu: ERROREA! Errore bat gertatu da irudia kargatzean.

# PLUGIN_IMAGE_FILE_NOT_LOADED
source: ERROR! There is not file already loaded.
es: ERROR! No hay ningún archivo cargado actualmente.
eu: ERROREA! Momentu honetan ez dago irudirik kargatuta.

# TASK_ADD_MODEL_COMPONENT_FOLDER_CANT_CREATE
source: Can't create folder "%s".
es: No se pudo crear la carpeta "%s".
